Revit 2017 API
StructuralSectionColdFormed Class
 Defines parameters for Hot Formed structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionColdFormed : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionColdFormed _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionColdFormed : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips
See Also
StructuralSectionColdFormed Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace